scripts/paper2/gridOpti/CaseOrig/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    PNe
    {
        type            noSlip;
    }
    PPe
    {
        type            noSlip;
    }
    frontAndBack
    {
	type		empty;
    }
    Inlet1
    {
    	//type	zeroGradient;
        type            fixedValue;
        value		uniform (VEX VEY VEZ);
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 0.833e-6;
        //type 			fixedMean;
        //meanValue		constant (VEX VEY VEZ);
        //value			$internalField;
    }
    Inlet2
    {
    	//type	zeroGradient;
        type            fixedValue;
        value		uniform (VEX VEY VEZ);
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 0.833e-6;
        //type 			fixedMean;
        //meanValue		constant (VEX VEY VEZ);
        //value			$internalField;
    }
    Outlet1
    {
        type            zeroGradient;
    }
        Outlet2
    {
        type            zeroGradient;
    }
        OWall
    {
        type            noSlip;
        
    }
    Walls
    {
            type            noSlip;
    	//type	zeroGradient;
        //type            fixedValue;
        //value		$internalField;
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 1e-4;
    }
    
}


// ************************************************************************* //
